farmertan81/Spot-Welder/STM32G474CE/src/main.c
    /* Ensure ADC is stopped first */
    if (hadc1.Instance->CR & ADC_CR_ADSTART) {
        hadc1.Instance->CR |= ADC_CR_ADSTP;
        uint32_t stop_timeout = 100000U;
        while (hadc1.Instance->CR & ADC_CR_ADSTP) {
            if (--stop_timeout == 0U) {
#if ADC_PAIR_VERBOSE_DEBUG
                uartSend("DBG,ADSTP_TIMEOUT");
#endif
                return false;
            }
        }
    }

    /* Ensure ADC is enabled and ready */
    if (!(hadc1.Instance->CR & ADC_CR_ADEN)) {
        hadc1.Instance->CR |= ADC_CR_ADEN;
        uint32_t ready_timeout = 100000U;
        while (!(hadc1.Instance->ISR & ADC_ISR_ADRDY)) {
            if (--ready_timeout == 0U) {
#if ADC_PAIR_VERBOSE_DEBUG
                uartSend("DBG,ADRDY_TIMEOUT");
#endif
                return false;
            }
        }
    }

    /* Clear stale conversion flags before starting */
    hadc1.Instance->ISR = ADC_ISR_EOC | ADC_ISR_EOS;

    /* Start conversion */
    hadc1.Instance->CR |= ADC_CR_ADSTART;

    /* Wait for Rank 1 EOC */
    uint32_t timeout = 100000U;
    while (!(hadc1.Instance->ISR & ADC_ISR_EOC)) {
        if (--timeout == 0U) {
            hadc1.Instance->CR |= ADC_CR_ADSTP;
#if ADC_PAIR_VERBOSE_DEBUG
            uartSend("DBG,REG_POLL1_TIMEOUT");
#endif
            return false;
        }
    }

    /* Read Rank 1 value immediately */
    *out_p = hadc1.Instance->DR;

    /* Wait for Rank 2 EOC */
    timeout = 100000U;
    while (!(hadc1.Instance->ISR & ADC_ISR_EOC)) {
        if (--timeout == 0U) {
            hadc1.Instance->CR |= ADC_CR_ADSTP;
#if ADC_PAIR_VERBOSE_DEBUG
            char msg[60];
            snprintf(msg, sizeof(msg), "DBG,REG_POLL2_TIMEOUT,p=%u",
                     (unsigned int)(*out_p));
            uartSend(msg);
#endif
            return false;
        }
    }

    /* Read Rank 2 value immediately */
    *out_n = hadc1.Instance->DR;

    /* Stop ADC and wait for stop complete */
    hadc1.Instance->CR |= ADC_CR_ADSTP;
    timeout = 100000U;
    while (hadc1.Instance->CR & ADC_CR_ADSTP) {
        if (--timeout == 0U) {
            /* Stop timeout is non-fatal here */
            break;
        }
    }

#if ADC_PAIR_VERBOSE_DEBUG
    {
        char msg[80];
        snprintf(msg, sizeof(msg), "DBG,ADC_PAIR,ok,p=%u,n=%u",
                 (unsigned int)(*out_p), (unsigned int)(*out_n));
        uartSend(msg);
    }
#endif

    return true;
}

static uint32_t adcReadFastVcapN(void) {
    if (hadc2.Instance->CR & ADC_CR_ADSTART) {
        hadc2.Instance->CR |= ADC_CR_ADSTP;
        uint32_t t = 10000U;
        while (hadc2.Instance->CR & ADC_CR_ADSTP) {
            if (--t == 0U) return 0U;
        }
    }
    hadc2.Instance->ISR = ADC_ISR_EOC | ADC_ISR_EOS;
    hadc2.Instance->CR |= ADC_CR_ADSTART;
    uint32_t t = 100000U;
    while (!(hadc2.Instance->ISR & ADC_ISR_EOC)) {
        if (--t == 0U) return 0U;
    }
    return hadc2.Instance->DR;
}

/* Fast-path weld current + Vcap+ read using register-level ADC access. */
static bool adcReadFastTriplet(uint32_t* out_p, uint32_t* out_n,
                               uint32_t* out_vp) {
    if (!out_p || !out_n || !out_vp) {
        return false;
    }

    *out_p = 0U;
    *out_n = 0U;
    *out_vp = 0U;

    if (!adc1_fast_current_mode) {
        return false;
    }

    if (hadc1.Instance->CR & ADC_CR_ADSTART) {
        hadc1.Instance->CR |= ADC_CR_ADSTP;
        uint32_t stop_timeout = 100000U;
        while (hadc1.Instance->CR & ADC_CR_ADSTP) {
            if (--stop_timeout == 0U) {
#if ADC_PAIR_VERBOSE_DEBUG
                uartSend("DBG,ADSTP_TIMEOUT");
#endif
                return false;
            }
        }
    }

    if (!(hadc1.Instance->CR & ADC_CR_ADEN)) {
        hadc1.Instance->CR |= ADC_CR_ADEN;
        uint32_t ready_timeout = 100000U;
        while (!(hadc1.Instance->ISR & ADC_ISR_ADRDY)) {
            if (--ready_timeout == 0U) {
#if ADC_PAIR_VERBOSE_DEBUG
                uartSend("DBG,ADRDY_TIMEOUT");
#endif
                return false;
            }
        }
    }

    hadc1.Instance->ISR = ADC_ISR_EOC | ADC_ISR_EOS;
    hadc1.Instance->CR |= ADC_CR_ADSTART;

    uint32_t timeout = 100000U;
    while (!(hadc1.Instance->ISR & ADC_ISR_EOC)) {
        if (--timeout == 0U) {
            hadc1.Instance->CR |= ADC_CR_ADSTP;
#if ADC_PAIR_VERBOSE_DEBUG
            uartSend("DBG,REG_POLL1_TIMEOUT");
#endif
            return false;
        }
    }
    *out_p = hadc1.Instance->DR;

    timeout = 100000U;
    while (!(hadc1.Instance->ISR & ADC_ISR_EOC)) {
        if (--timeout == 0U) {
            hadc1.Instance->CR |= ADC_CR_ADSTP;
            return false;
        }
    }
    *out_n = hadc1.Instance->DR;

    timeout = 100000U;
    while (!(hadc1.Instance->ISR & ADC_ISR_EOC)) {
        if (--timeout == 0U) {
            hadc1.Instance->CR |= ADC_CR_ADSTP;
            return false;
        }
    }
    *out_vp = hadc1.Instance->DR;

    hadc1.Instance->CR |= ADC_CR_ADSTP;
    timeout = 100000U;
    while (hadc1.Instance->CR & ADC_CR_ADSTP) {
        if (--timeout == 0U) {
            break;
        }
    }

    return true;
}

static void capturePulseAmpsForDurationUs(uint32_t pulse_duration_us,
                                          uint16_t duty) {
    uint32_t peak_raw = 0;
    float peak_current = 0.0f;
    float sum_current = 0.0f;
    uint32_t sample_count = 0;

    if (pulse_duration_us == 0U) {
        cal_adc_peak_raw = 0U;
        cal_current_avg = 0.0f;
        return;
    }

    const float v_per_count = measured_vdda / 4095.0f;

    /*
     * IMPORTANT (preheat fix): when PWM duty < 100%, sampling exactly every
     * 100us can phase-lock to TIM1's 100us period and repeatedly hit OFF time,
     * producing false near-zero current during preheat. Sweep several ADC reads
     * across each 100us sample slot and keep the max to reliably capture
     * ON-time current.
     */
    const bool pulse_uses_pwm_window =
        (duty > 0U) && (duty < PWM_MAX) &&
        (WAVEFORM_SAMPLE_INTERVAL_US == PWM_PERIOD_US);

    uint32_t pulse_start_us = micros_now();
    uint32_t pulse_end_estimate_us = pulse_start_us + pulse_duration_us;
    uint32_t next_sample_us = pulse_start_us;

