farmertan81/Spot-Welder/STM32G474CE/src/main.c
    const bool joule_mode_active = (control_mode == 1U);
    const uint32_t joule_bad_contact_limit_us = 5000U;
    uint32_t joule_low_current_streak_us = 0U;
    uint32_t joule_duration_offset_us = joule_actual_duration_us;
    uint32_t joule_last_sample_elapsed_us = 0U;

    /*
     * ── BRICK SHITHOUSE TIMING ──────────────────────────────────────────
     *
     * TIM2 is ALREADY RUNNING — started by doPulseMsPwm() back-to-back
     * with pwmOnDuty() so scope-measured pulse width matches config.
     *
     * The ISR (TIM2_IRQHandler) will fire when TIM2 overflows and call
     * pwmOff() within ~70 ns.  This loop just samples ADC until the ISR
     * sets tim2_fet_killed.
     *
     * If called from a context where TIM2 was NOT pre-started (safety),
     * tim2_fet_killed will already be false and the loop works normally
     * — it just won't have the tight timing guarantee.
     * ────────────────────────────────────────────────────────────────────
     */

    /* ── Sampling loop ─────────────────────────────────────────────────
     * We sample ADC while the FET is on.  When TIM2 expires the ISR
     * kills the FET and sets tim2_fet_killed; the loop exits cleanly.
     * No SR polling for pwmOff timing – that is 100 % hardware now.
     * ─────────────────────────────────────────────────────────────────
     */
    while (!tim2_fet_killed) {
        uint32_t now_us = micros_now();
        if ((int32_t)(now_us - next_sample_us) < 0) {
            continue;
        }

        int32_t diff = 0;
        float amps = 0.0f;
        float v_cap_live = cached_vcap;
        uint32_t sample_capture_us = now_us;

        if (pulse_uses_pwm_window) {
            int32_t best_diff = 0;
            float best_amps = 0.0f;
            float best_v_cap_live = cached_vcap;
            uint32_t best_sample_us = now_us;
            uint32_t slot_anchor_us = next_sample_us;
            bool have_sweep_sample = false;

            for (uint16_t sweep_i = 0;
                 sweep_i < WAVEFORM_PWM_PHASE_SWEEP_SAMPLES; sweep_i++) {
                if (tim2_fet_killed) break;

                uint32_t target_us =
                    slot_anchor_us +
                    ((uint32_t)sweep_i * WAVEFORM_PWM_PHASE_SWEEP_STEP_US);
                if ((int32_t)(target_us - pulse_end_estimate_us) >= 0) {
                    break;
                }

                while (!tim2_fet_killed &&
                       ((int32_t)(micros_now() - target_us) < 0)) {
                    __NOP();
                }

                if (tim2_fet_killed) break;

                uint32_t p = 0U;
                uint32_t n = 0U;
                uint32_t v_p = 0U;
                if (!adcReadFastTriplet(&p, &n, &v_p)) {
                    continue;
                }

                uint32_t sweep_sample_us = micros_now();
                uint32_t v_n = adc2_fast_vcap_mode ? adcReadFastVcapN() : 0U;

                int32_t sweep_diff = (int32_t)p - (int32_t)n;
                if (sweep_diff < 0) {
                    sweep_diff = 0;
                }

                float sweep_v_adc = (float)sweep_diff * v_per_count;
                float sweep_v_shunt = sweep_v_adc / SHUNT_GAIN;
                float sweep_amps =
                    (sweep_v_shunt / SHUNT_EFF_OHMS) * CURRENT_CAL_FACTOR;
                if (!isfinite(sweep_amps) || sweep_amps < 0.0f) {
                    sweep_amps = 0.0f;
                }

                float sweep_v_cap_live = ((float)v_p - (float)v_n) *
                                         (measured_vdda / 4095.0f) *
                                         V_CAP_DIVIDER;
                if (!isfinite(sweep_v_cap_live) || sweep_v_cap_live < 0.0f) {
                    sweep_v_cap_live = 0.0f;
                }

                if (!have_sweep_sample || sweep_amps >= best_amps) {
                    best_amps = sweep_amps;
                    best_diff = sweep_diff;
                    best_v_cap_live = sweep_v_cap_live;
                    best_sample_us = sweep_sample_us;
                    have_sweep_sample = true;
                }
            }

            if (!have_sweep_sample) {
                break;
            }

            diff = best_diff;
            amps = best_amps;
            v_cap_live = best_v_cap_live;
            sample_capture_us = best_sample_us;
        } else {
            uint32_t p = 0U;
            uint32_t n = 0U;
            uint32_t v_p = 0U;
            if (tim2_fet_killed) break;
            if (!adcReadFastTriplet(&p, &n, &v_p)) {
                continue;
            }
            sample_capture_us = micros_now();

            uint32_t v_n = adc2_fast_vcap_mode ? adcReadFastVcapN() : 0U;

            diff = (int32_t)p - (int32_t)n;
            if (diff < 0) {
                diff = 0;
            }

            float v_adc = (float)diff * v_per_count;
            float v_shunt = v_adc / SHUNT_GAIN;
            amps = (v_shunt / SHUNT_EFF_OHMS) * CURRENT_CAL_FACTOR;
            if (!isfinite(amps) || amps < 0.0f) amps = 0.0f;

            v_cap_live = ((float)v_p - (float)v_n) * (measured_vdda / 4095.0f) *
                         V_CAP_DIVIDER;
            if (!isfinite(v_cap_live) || v_cap_live < 0.0f) {
                v_cap_live = 0.0f;
            }
        }

        if ((uint32_t)diff > peak_raw) peak_raw = (uint32_t)diff;
        if (amps > peak_current) peak_current = amps;
        sum_current += amps;
        sample_count++;

        (void)waveform_push_sample(
            amps, v_cap_live,
            (uint32_t)(sample_capture_us - waveform_capture_start_us));

        if (joule_mode_active) {
            uint32_t elapsed_us = sample_capture_us - pulse_start_us;
            uint32_t dt_us = elapsed_us - joule_last_sample_elapsed_us;
            if (dt_us == 0U) {
                dt_us = WAVEFORM_SAMPLE_INTERVAL_US;
            }
            joule_last_sample_elapsed_us = elapsed_us;
            joule_actual_duration_us = joule_duration_offset_us + elapsed_us;
            float joule_dt_sec = (float)dt_us * 1.0e-6f;

