farmertan81/Spot-Welder/STM32G474CE/src/main.c
            /* Real-time Joule integration (lead-compensated):
             * Total power = Vcap * I
             * Lead loss power = I^2 * R_lead
             * Workpiece power = Total - Lead losses */
            float total_power_w = v_cap_live * amps;
            if (!isfinite(total_power_w) || total_power_w < 0.0f) {
                total_power_w = 0.0f;
            }

            float lead_loss_power_w = amps * amps * lead_resistance_ohms;
            if (!isfinite(lead_loss_power_w) || lead_loss_power_w < 0.0f) {
                lead_loss_power_w = 0.0f;
            }

            float workpiece_power_w = total_power_w - lead_loss_power_w;
            if (!isfinite(workpiece_power_w) || workpiece_power_w < 0.0f) {
                workpiece_power_w = 0.0f;
            }

            joule_total_accumulated += total_power_w * joule_dt_sec;
            joule_lead_loss_accumulated += lead_loss_power_w * joule_dt_sec;
            joule_accumulated += workpiece_power_w * joule_dt_sec;

            /* 1) Highest priority: stop immediately when workpiece target is
             * met. */
            if (joule_accumulated >= (joule_target_j - JOULE_OVERSHOOT_COMP)) {
                joule_target_reached = true;
                pwmOff();
                tim2_fet_killed = true;
                char jdbg[196];
                snprintf(jdbg, sizeof(jdbg),
                         "DBG,JOULE_TARGET_REACHED,target_j=%.2f,cutoff_j=%.2f,"
                         "actual_j=%.2f,total_j=%.2f,loss_j=%.2f,elapsed_us=%"
                         "lu,dt_us=%lu",
                         joule_target_j, joule_target_j - JOULE_OVERSHOOT_COMP,
                         joule_accumulated, joule_total_accumulated,
                         joule_lead_loss_accumulated, (unsigned long)elapsed_us,
                         (unsigned long)dt_us);
                uartSend(jdbg);
                break;
            }

            /* 2) Safety backup timeout (only if energy target did not fire). */
            if (elapsed_us >= (joule_max_ms * 1000U)) {
                joule_timeout_abort = true;
                pwmOff();
                tim2_fet_killed = true;
                char jdbg[176];
                snprintf(jdbg, sizeof(jdbg),
                         "DBG,JOULE_TIMEOUT,target_j=%.2f,actual_j=%.2f,max_ms="
                         "%lu,elapsed_us=%lu",
                         joule_target_j, joule_accumulated,
                         (unsigned long)joule_max_ms,
                         (unsigned long)elapsed_us);
                uartSend(jdbg);
                break;
            }

            /* 3) Bad contact: current too low continuously for >5 ms */
            if (amps < joule_min_current_a) {
                joule_low_current_streak_us += dt_us;
            } else {
                joule_low_current_streak_us = 0U;
            }

            if (joule_low_current_streak_us >= joule_bad_contact_limit_us) {
                joule_bad_contact_abort = true;
                pwmOff();
                tim2_fet_killed = true;
                char jdbg[176];
                snprintf(jdbg, sizeof(jdbg),
                         "DBG,JOULE_BAD_CONTACT,target_j=%.2f,actual_j=%.2f,"
                         "low_current_us=%lu",
                         joule_target_j, joule_accumulated,
                         (unsigned long)joule_low_current_streak_us);
                uartSend(jdbg);
                break;
            }
        }

        waveform_last_sample_us = sample_capture_us;
        next_sample_us += WAVEFORM_SAMPLE_INTERVAL_US;

        now_us = micros_now();
        while ((int32_t)(now_us - next_sample_us) >= 0) {
            next_sample_us += WAVEFORM_SAMPLE_INTERVAL_US;
        }
    }

    /* FET is already OFF (killed by TIM2 ISR).  Clean up timer state. */
    TIM2->DIER = 0U; /* disarm UIE so gap delay doesn't trigger ISR */
    TIM2->CR1 = 0U;
    TIM2->SR = 0U;

    cal_adc_peak_raw = peak_raw;
    if (peak_current > current_peak_amps) current_peak_amps = peak_current;
    cal_current_avg =
        (sample_count > 0U) ? (sum_current / (float)sample_count) : 0.0f;
}

/* ============ Waveform Capture Helpers (Phase 3) ============ */
/* Returns microsecond timestamp from DWT cycle counter.
 * Hardcoded for 170MHz to avoid division recalculation and truncation drift.
 * WARNING: Rolls over every ~25 seconds at 170MHz.
 * Use ONLY for time deltas < 25 seconds. */
static inline uint32_t micros_now(void) {
    return DWT->CYCCNT / 170U;  // Hardcoded for 170MHz STM32G474
}

/**
 * Initialize TIM2 as a 1 MHz precision timer for pulse duration control.
 *
 * Clock: 170 MHz APB1 -> PSC=169 -> 1 MHz (1 microsecond per tick).
 * TIM2 is 32-bit, giving up to ~4295 seconds range.
 *
 * CRITICAL FOR SYNCHRONOUS BUCK:
 * TIM2 Update interrupt is configured at the HIGHEST NVIC priority (0,0).
 * When TIM2 expires, the ISR fires within ~70 ns and calls pwmOff(),
 * guaranteeing sub-microsecond FET turn-off accuracy regardless of what
 * the main-thread code is doing (ADC reads, float math, etc.).
 *
 * The UIE (Update Interrupt Enable) bit is NOT set here; it is armed
 * per-pulse in capturePulseAmpsForDurationUs() to avoid spurious
 * interrupts during gap delays or idle periods.
 */
static void init_tim2_1mhz(void) {
    __HAL_RCC_TIM2_CLK_ENABLE();

    TIM2->PSC = 169U;        /* 170MHz / (169+1) = 1MHz  (1 µs/tick) */
    TIM2->ARR = 0xFFFFFFFFU; /* Max reload (overwritten per-pulse)    */
    TIM2->CR1 = 0U;          /* Stopped by default                    */
    TIM2->DIER = 0U;         /* No interrupts yet (armed per-pulse)   */
    TIM2->SR = 0U;           /* Clear any pending flags               */
    TIM2->EGR = TIM_EGR_UG;  /* Load PSC into shadow register NOW     */

    /* NVIC: TIM2 at absolute highest priority so the FET-kill ISR
     * preempts everything – UART, SysTick, TIM1, ADC, etc.          */
    HAL_NVIC_SetPriority(TIM2_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
}

/**
 * Hardware delay using TIM2 one-shot mode.
 * Provides deterministic timing with zero jitter.
 * @param delay_us: Delay in microseconds (max ~4.2 seconds for 32-bit)
 */
static void tim2_delay_us(uint32_t delay_us) {
    if (delay_us == 0U) {
        return;
    }

