farmertan81/Spot-Welder/STM32G474CE/src/main.c
        int32_t diff = (int32_t)p - (int32_t)n;
        if (diff < 0) {
            diff = 0;
        }

        float v_adc = (float)diff * v_per_count;
        float v_shunt = v_adc / SHUNT_GAIN;
        float amps = (v_shunt / SHUNT_EFF_OHMS) * CURRENT_CAL_FACTOR;
        if (!isfinite(amps) || amps < 0.0f) {
            amps = 0.0f;
        }

        waveform_push_sample(
            amps, cached_vcap,
            (uint32_t)(sample_time_us - waveform_capture_start_us));

        captured++;
        waveform_last_sample_us = sample_time_us;
        next_sample_us += WAVEFORM_SAMPLE_INTERVAL_US;

        now_us = micros_now();
        while ((int32_t)(now_us - next_sample_us) >= 0) {
            next_sample_us += WAVEFORM_SAMPLE_INTERVAL_US;
        }
    }

    return captured;
}

static void end_weld_pulse_capture(void) {
    waveform_capture_active = false;
#if ADC_PAIR_VERBOSE_DEBUG
    char dbg[96];
    snprintf(dbg, sizeof(dbg),
             "DBG,WAVEFORM_CAPTURE_STOP,count=%u,pulse_start_idx=%u,pulse_end_"
             "idx=%u",
             (unsigned int)waveform_index,
             (unsigned int)waveform_pulse_start_index,
             (unsigned int)waveform_pulse_end_index);
    uartSend(dbg);
#endif
}

static void apply_waveform_voltage_interpolation(float vcap_start,
                                                 float vcap_end,
                                                 uint16_t pulse_start_index,
                                                 uint16_t pulse_end_index) {
    if (waveform_index == 0U) {
        return;
    }

    if (pulse_start_index > waveform_index) {
        pulse_start_index = waveform_index;
    }

    if (pulse_end_index < pulse_start_index) {
        pulse_end_index = pulse_start_index;
    }

    if (pulse_end_index > waveform_index) {
        pulse_end_index = waveform_index;
    }

    for (uint16_t i = 0; i < pulse_start_index; i++) {
        waveform_buffer[i].voltage_volts = vcap_start;
    }

    if (pulse_end_index > pulse_start_index) {
        const float dv = vcap_start - vcap_end;
        const float denom = (float)(pulse_end_index - pulse_start_index);

        for (uint16_t i = pulse_start_index; i < pulse_end_index; i++) {
            const float t = (float)(i - pulse_start_index) / denom;
            waveform_buffer[i].voltage_volts = vcap_start - (dv * t);
        }
    }

    for (uint16_t i = pulse_end_index; i < waveform_index; i++) {
        waveform_buffer[i].voltage_volts = vcap_end;
    }
}

static void send_waveform_data(void) {
    if (waveform_index == 0) {
#if ADC_PAIR_VERBOSE_DEBUG
        uartSend("DBG,WAVEFORM_EMPTY");
#endif
        return;
    }

    /* Static to avoid allocating 25KB on stack each call. */
    static char line[WAVEFORM_LINE_BUFFER_SIZE];

    uint16_t pre_start = waveform_preheat_start_index;
    uint16_t pre_end = waveform_preheat_end_index;
    uint16_t gap_start = waveform_gap_start_index;
    uint16_t gap_end = waveform_gap_end_index;
    uint16_t main_start = waveform_main_start_index;
    uint16_t main_end = waveform_main_end_index;

    if (!preheat_enabled || preheat_ms == 0U) {
        pre_start = 0U;
        pre_end = 0U;
        gap_start = 0U;
        gap_end = 0U;
    }

    int n = snprintf(line, sizeof(line), "WAVEFORM_START,%u,%u,%u,%u,%u,%u,%u",
                     (unsigned int)waveform_index, (unsigned int)pre_start,
                     (unsigned int)pre_end, (unsigned int)gap_start,
                     (unsigned int)gap_end, (unsigned int)main_start,
                     (unsigned int)main_end);
    if (n > 0 && n < (int)sizeof(line)) {
        uartSend(line);
    }

    for (uint16_t chunk_start = 0; chunk_start < waveform_index;
         chunk_start += (uint16_t)WAVEFORM_CHUNK_SAMPLES) {
        uint16_t remaining = (uint16_t)(waveform_index - chunk_start);
        uint16_t chunk_count = (remaining > (uint16_t)WAVEFORM_CHUNK_SAMPLES)
                                   ? (uint16_t)WAVEFORM_CHUNK_SAMPLES
                                   : remaining;

        n = snprintf(line, sizeof(line), "WAVEFORM_DATA,%u,%u",
                     (unsigned int)chunk_start, (unsigned int)chunk_count);

        for (uint16_t i = 0; i < chunk_count; i++) {
            uint16_t sample_idx = (uint16_t)(chunk_start + i);
            if (n <= 0 || n >= (int)sizeof(line)) break;
            n += snprintf(
                line + n, sizeof(line) - (size_t)n, ",%lu,%.2f,%.2f",
                (unsigned long)waveform_buffer[sample_idx].timestamp_us,
                waveform_buffer[sample_idx].voltage_volts,
                waveform_buffer[sample_idx].current_amps);
            if (n >= (int)sizeof(line)) break;
        }

        if (n <= 0 || n >= (int)sizeof(line)) {
#if ADC_PAIR_VERBOSE_DEBUG
            char warn[96];
            snprintf(warn, sizeof(warn),
                     "DBG,WAVEFORM_CHUNK_TRUNCATED,start=%u,count=%u,buf=%u",
                     (unsigned int)chunk_start, (unsigned int)chunk_count,
                     (unsigned int)sizeof(line));
            uartSend(warn);
#endif
            continue;
        }

        uartSend(line);
    }

    uartSend("WAVEFORM_END");

    {
        uint32_t preheat_start_rel =
            (wf_preheat_start_us >= waveform_capture_start_us)
                ? (wf_preheat_start_us - waveform_capture_start_us)
                : 0U;
        uint32_t preheat_end_rel =
            (wf_preheat_end_us >= waveform_capture_start_us)
                ? (wf_preheat_end_us - waveform_capture_start_us)
                : 0U;
        uint32_t gap_start_rel =
            (wf_gap_start_us >= waveform_capture_start_us)
                ? (wf_gap_start_us - waveform_capture_start_us)
                : 0U;
        uint32_t gap_end_rel = (wf_gap_end_us >= waveform_capture_start_us)
                                   ? (wf_gap_end_us - waveform_capture_start_us)
                                   : 0U;
        uint32_t main_start_rel =
            (wf_main_start_us >= waveform_capture_start_us)
                ? (wf_main_start_us - waveform_capture_start_us)
                : 0U;
        uint32_t main_end_rel =
            (wf_main_end_us >= waveform_capture_start_us)
                ? (wf_main_end_us - waveform_capture_start_us)
                : 0U;

        if (!preheat_enabled || preheat_ms == 0U) {
            preheat_start_rel = 0U;
            preheat_end_rel = 0U;
        }

