farmertan81/Spot-Welder/STM32G474CE/src/main.c
    if (weld_mode >= 1 && !joule_stop_requested) {
        uint16_t main1_start_idx = waveform_index;
        uint32_t* main1_start_us_ptr = NULL;
        if (!main_pulse_started) {
            waveform_pulse_start_index = main1_start_idx;
            waveform_main_start_index = main1_start_idx;
            waveform_gap_end_index = main1_start_idx;
            main1_start_us_ptr = &wf_main_start_us;
            main_pulse_started = true;
        }
        main_pulse_elapsed_us += doPulseMsPwm(
            main1_ms, mainDuty, main1_start_us_ptr, &wf_main_end_us, NULL);
        uint16_t main1_end_idx = waveform_index;
        if (main1_start_us_ptr != NULL) {
            uint32_t aligned_main_start_us = 0U;
            if (resolve_phase_start_from_waveform(
                    main1_start_idx, main1_end_idx, &aligned_main_start_us)) {
                wf_main_start_us = aligned_main_start_us;
            }
        }
        {
            uint32_t aligned_main_end_us = 0U;
            if (resolve_phase_end_from_waveform(main1_start_idx, main1_end_idx,
                                                &aligned_main_end_us)) {
                wf_main_end_us = aligned_main_end_us;
            }
        }
        actual_pulse_end_index = main1_end_idx;
        waveform_main_end_index = main1_end_idx;
#if ADC_PAIR_VERBOSE_DEBUG
        char mdbg[180];
        snprintf(
            mdbg, sizeof(mdbg),
            "DBG,MAIN1_CAPTURE_END,cfg_ms=%u,samples=%u,start_idx=%u,end_idx=%"
            "u",
            (unsigned int)weld_d1_ms,
            (unsigned int)((main1_end_idx >= main1_start_idx)
                               ? (uint16_t)(main1_end_idx - main1_start_idx)
                               : 0U),
            (unsigned int)main1_start_idx, (unsigned int)main1_end_idx);
        uartSend(mdbg);
#endif
    }

    /* JOULE MODE: phase 1 IS the entire weld. If the single energy-controlled
     * pulse finished without the workpiece reaching the target and without a
     * bad-contact abort, the pulse was cut off by the joule_max_ms safety cap
     * — report this as a TIMEOUT so the user knows to raise joule_max_ms (or
     * reduce lead losses). This also covers the race where TIM2 kills the FET
     * exactly at joule_max_ms before the in-loop timeout flag is set. */
    if (joule_mode && !joule_target_reached && !joule_bad_contact_abort) {
        joule_timeout_abort = true;
    }

    joule_stop_requested =
        (control_mode == 1U) && (joule_target_reached || joule_timeout_abort ||
                                 joule_bad_contact_abort);

    if (weld_mode >= 2 && !joule_mode && !joule_stop_requested) {
        if (weld_gap1_ms) captureGapMsWithWaveform(weld_gap1_ms);
        uint16_t main2_start_idx = waveform_index;
        uint32_t* main2_start_us_ptr = NULL;
        if (!main_pulse_started) {
            waveform_pulse_start_index = main2_start_idx;
            waveform_main_start_index = main2_start_idx;
            waveform_gap_end_index = main2_start_idx;
            main2_start_us_ptr = &wf_main_start_us;
            main_pulse_started = true;
        }
        main_pulse_elapsed_us += doPulseMsPwm(
            weld_d2_ms, mainDuty, main2_start_us_ptr, &wf_main_end_us, NULL);
        uint16_t main2_end_idx = waveform_index;
        if (main2_start_us_ptr != NULL) {
            uint32_t aligned_main_start_us = 0U;
            if (resolve_phase_start_from_waveform(
                    main2_start_idx, main2_end_idx, &aligned_main_start_us)) {
                wf_main_start_us = aligned_main_start_us;
            }
        }
        {
            uint32_t aligned_main_end_us = 0U;
            if (resolve_phase_end_from_waveform(main2_start_idx, main2_end_idx,
                                                &aligned_main_end_us)) {
                wf_main_end_us = aligned_main_end_us;
            }
        }
        actual_pulse_end_index = main2_end_idx;
        waveform_main_end_index = main2_end_idx;
#if ADC_PAIR_VERBOSE_DEBUG
        char mdbg[180];
        snprintf(
            mdbg, sizeof(mdbg),
            "DBG,MAIN2_CAPTURE_END,cfg_ms=%u,samples=%u,start_idx=%u,end_idx=%"
            "u",
            (unsigned int)weld_d2_ms,
            (unsigned int)((main2_end_idx >= main2_start_idx)
                               ? (uint16_t)(main2_end_idx - main2_start_idx)
                               : 0U),
            (unsigned int)main2_start_idx, (unsigned int)main2_end_idx);
        uartSend(mdbg);
#endif
    }

    joule_stop_requested =
        (control_mode == 1U) && (joule_target_reached || joule_timeout_abort ||
                                 joule_bad_contact_abort);

    if (weld_mode >= 3 && !joule_mode && !joule_stop_requested) {
        if (weld_gap2_ms) captureGapMsWithWaveform(weld_gap2_ms);
        uint16_t main3_start_idx = waveform_index;
        uint32_t* main3_start_us_ptr = NULL;
        if (!main_pulse_started) {
            waveform_pulse_start_index = main3_start_idx;
            waveform_main_start_index = main3_start_idx;
            waveform_gap_end_index = main3_start_idx;
            main3_start_us_ptr = &wf_main_start_us;
            main_pulse_started = true;
        }
        main_pulse_elapsed_us += doPulseMsPwm(
            weld_d3_ms, mainDuty, main3_start_us_ptr, &wf_main_end_us, NULL);
        uint16_t main3_end_idx = waveform_index;
        if (main3_start_us_ptr != NULL) {
            uint32_t aligned_main_start_us = 0U;
            if (resolve_phase_start_from_waveform(
                    main3_start_idx, main3_end_idx, &aligned_main_start_us)) {
                wf_main_start_us = aligned_main_start_us;
            }
        }
        {
            uint32_t aligned_main_end_us = 0U;
            if (resolve_phase_end_from_waveform(main3_start_idx, main3_end_idx,
                                                &aligned_main_end_us)) {
                wf_main_end_us = aligned_main_end_us;
            }
        }
        actual_pulse_end_index = main3_end_idx;
        waveform_main_end_index = main3_end_idx;
#if ADC_PAIR_VERBOSE_DEBUG
        char mdbg[180];
        snprintf(
            mdbg, sizeof(mdbg),
            "DBG,MAIN3_CAPTURE_END,cfg_ms=%u,samples=%u,start_idx=%u,end_idx=%"
            "u",
            (unsigned int)weld_d3_ms,
            (unsigned int)((main3_end_idx >= main3_start_idx)
                               ? (uint16_t)(main3_end_idx - main3_start_idx)
                               : 0U),
            (unsigned int)main3_start_idx, (unsigned int)main3_end_idx);
        uartSend(mdbg);
#endif
    }

    if (!main_pulse_started) {
        waveform_pulse_start_index = waveform_index;
        waveform_main_start_index = waveform_index;
        actual_pulse_end_index = waveform_index;
        waveform_main_end_index = waveform_index;
    }

    uint32_t weld_end_us = micros_now();
    uint32_t total_ms =
        (uint32_t)((weld_end_us - weld_start_us + 500U) / 1000U);

    pwmOff();

    /* Use ACTUAL captured pulse end index (exclusive), not ms-planned index.
     * This keeps avg_a/sample window inside captured waveform bounds even when
     * ADC sampling throughput produces fewer samples than planned. */
    {
        uint16_t pulse_end_index = actual_pulse_end_index;
        if (pulse_end_index > waveform_index) {
            pulse_end_index = waveform_index;
        }
        waveform_pulse_end_index = pulse_end_index;
        waveform_main_end_index = pulse_end_index;
    }
    if (waveform_index < WAVEFORM_BUFFER_SIZE) {
        uint16_t remaining_samples =
            (uint16_t)(WAVEFORM_BUFFER_SIZE - waveform_index);
        uint16_t post_samples =
            (remaining_samples < (uint16_t)WAVEFORM_POST_SAMPLES)
                ? remaining_samples
                : (uint16_t)WAVEFORM_POST_SAMPLES;
        capture_waveform_samples(post_samples);
    }

    /* Phase 3: stop waveform capture after full window. */
    end_weld_pulse_capture();

    /* Timing/debug uses ACTUAL waveform timestamps from pulse [start,end)
     * window (end index is exclusive). */
    uint32_t pulse_duration_us = main_pulse_elapsed_us;
    {
        if (waveform_index > 0U) {
            uint16_t pulse_start_index = waveform_pulse_start_index;
            uint16_t pulse_end_index_exclusive = waveform_pulse_end_index;

