farmertan81/Spot-Welder/STM32G474CE/src/main.c
    /* Integrate TRUE weld energy at tips using timestamp-based trapezoids.
     *
     * E_weld = Σ(0.5 * (P[i] + P[i+1]) * dt[i]),
     * P[i]   = V_tip[i] * I[i],
     * V_tip  = V_cap - I*R_lead
     *
     * Lead-loss energy is computed separately from main-pulse avg current and
     * pulse duration to keep it aligned with the commanded main pulse window.
     */
    float energy_weld_joules = 0.0f;
    float energy_leads_joules = 0.0f;
    float integrated_duration_s = 0.0f;
    const float nominal_dt_s = (float)WAVEFORM_SAMPLE_INTERVAL_US * 1.0e-6f;

    for (uint16_t i = pulse_start_sample; i < pulse_end_sample; i++) {
        float i_shunt = waveform_buffer[i].current_amps;
        float v_cap = waveform_buffer[i].voltage_volts;

        if (!isfinite(i_shunt) || i_shunt < 0.0f) i_shunt = 0.0f;
        if (!isfinite(v_cap) || v_cap < 0.0f) v_cap = 0.0f;

        pulse_sum_current += i_shunt;
        pulse_sum_voltage += v_cap;
        pulse_count++;
    }

    if ((pulse_end_sample - pulse_start_sample) >= 2U) {
        for (uint16_t i = pulse_start_sample;
             (uint16_t)(i + 1U) < pulse_end_sample; i++) {
            float i0 = waveform_buffer[i].current_amps;
            float v0 = waveform_buffer[i].voltage_volts;
            float i1 = waveform_buffer[i + 1U].current_amps;
            float v1 = waveform_buffer[i + 1U].voltage_volts;

            if (!isfinite(i0) || i0 < 0.0f) i0 = 0.0f;
            if (!isfinite(v0) || v0 < 0.0f) v0 = 0.0f;
            if (!isfinite(i1) || i1 < 0.0f) i1 = 0.0f;
            if (!isfinite(v1) || v1 < 0.0f) v1 = 0.0f;

            float dt_s = nominal_dt_s;
            uint32_t t_us = waveform_buffer[i].timestamp_us;
            uint32_t t_next_us = waveform_buffer[i + 1U].timestamp_us;
            if (t_next_us > t_us) {
                dt_s = (float)(t_next_us - t_us) * 1.0e-6f;
            }
            if (!isfinite(dt_s) || dt_s <= 0.0f) dt_s = nominal_dt_s;

            float v_tip0 = v0 - (i0 * lead_resistance_ohms);
            float v_tip1 = v1 - (i1 * lead_resistance_ohms);
            if (!isfinite(v_tip0) || v_tip0 < 0.0f) v_tip0 = 0.0f;
            if (!isfinite(v_tip1) || v_tip1 < 0.0f) v_tip1 = 0.0f;

            float p0_watts = v_tip0 * i0;
            float p1_watts = v_tip1 * i1;
            if (!isfinite(p0_watts) || p0_watts < 0.0f) p0_watts = 0.0f;
            if (!isfinite(p1_watts) || p1_watts < 0.0f) p1_watts = 0.0f;

            energy_weld_joules += 0.5f * (p0_watts + p1_watts) * dt_s;

            integrated_duration_s += dt_s;
        }
    } else if ((pulse_end_sample - pulse_start_sample) == 1U) {
        /* Degenerate case: one in-window sample only. */
        integrated_duration_s = nominal_dt_s;
    }

    if (!isfinite(energy_weld_joules) || energy_weld_joules < 0.0f) {
        energy_weld_joules = 0.0f;
    }
    if (!isfinite(integrated_duration_s) || integrated_duration_s < 0.0f) {
        integrated_duration_s = 0.0f;
    }

    cal_current_avg =
        (pulse_count > 0U) ? (pulse_sum_current / (float)pulse_count) : 0.0f;
    float avg_vcap_pulse = (pulse_count > 0U)
                               ? (pulse_sum_voltage / (float)pulse_count)
                               : cal_vcap_before;

    /* Main pulse duration source-of-truth: deadline-controlled ON-window.
     * Fall back to integrated waveform timing if needed. */
    float pulse_time_s = (pulse_duration_us > 0U)
                             ? ((float)pulse_duration_us * 1.0e-6f)
                             : integrated_duration_s;
    if (!isfinite(pulse_time_s) || pulse_time_s < 0.0f) {
        pulse_time_s = 0.0f;
    }
    if (pulse_time_s <= 0.0f && integrated_duration_s > 0.0f) {
        pulse_time_s = integrated_duration_s;
    }

    /* Lead loss uses main-pulse avg current and main-pulse duration only. */
    energy_leads_joules =
        cal_current_avg * cal_current_avg * lead_resistance_ohms * pulse_time_s;
    if (!isfinite(energy_leads_joules) || energy_leads_joules < 0.0f) {
        energy_leads_joules = 0.0f;
    }

    pulse_duration_us = (uint32_t)(pulse_time_s * 1000000.0f + 0.5f);
    total_ms = (uint32_t)(pulse_time_s * 1000.0f + 0.5f);
    float pulse_duration_ms = pulse_time_s * 1000.0f;

    float delta_v = cal_vcap_before - cal_vcap_after;

    /* Cap-bank ΔV method kept as energy_j source-of-truth for compatibility. */
    float energy_cap_joules =
        0.5f * CAP_FARADS *
        (cal_vcap_before * cal_vcap_before - cal_vcap_after * cal_vcap_after);
    if (!isfinite(energy_cap_joules) || energy_cap_joules < 0.0f) {
        energy_cap_joules = 0.0f;
    }

    /* Physics guardrail: lead dissipation cannot exceed capacitor energy. */
    if (energy_cap_joules > 0.0f && energy_leads_joules > energy_cap_joules) {
        energy_leads_joules = energy_cap_joules * 0.95f;
    }

    /* Tip voltage from average pulse voltage minus lead drop (diagnostic). */
    float v_drop_leads = cal_current_avg * lead_resistance_ohms;
    float v_at_tips = avg_vcap_pulse - v_drop_leads;
    if (!isfinite(v_at_tips) || v_at_tips < 0.0f) v_at_tips = 0.0f;

    char buf[576];
    snprintf(
        buf, sizeof(buf),
        "EVENT,WELD_DONE,total_ms=%lu,mode=%d,d1=%d,gap1=%d,d2=%d,gap2=%d,"
        "d3=%d,power_pct=%d,preheat_en=%d,preheat_ms=%d,"
        "peak_a=%.1f,adc_raw=%lu,vcap_b=%.3f,vcap_a=%.3f,delta_v=%.3f,"
        "avg_a=%.1f,v_tips=%.3f,energy_j=%.2f,energy_cap_j=%.2f,energy_"
        "lead_j=%.2f,energy_weld_j=%.2f,joule_total_j=%.2f,"
        "joule_workpiece_j=%.2f,joule_loss_j=%.2f,pulse_ms=%.2f,"
        "pulse_start_sample=%u,pulse_end_sample=%u,wf_samples=%u",
        (unsigned long)total_ms, weld_mode, weld_d1_ms, weld_gap1_ms,
        weld_d2_ms, weld_gap2_ms, weld_d3_ms, weld_power_pct,
        preheat_enabled ? 1 : 0, preheat_ms, current_peak_amps,
        (unsigned long)cal_adc_peak_raw, cal_vcap_before, cal_vcap_after,
        delta_v, cal_current_avg, v_at_tips, energy_weld_joules,
        energy_cap_joules, energy_leads_joules, energy_weld_joules,
        joule_total_accumulated, joule_accumulated, joule_lead_loss_accumulated,
        pulse_duration_ms, (unsigned int)waveform_pulse_start_index,
        (unsigned int)waveform_pulse_end_index, (unsigned int)waveform_index);
    uartSend(buf);

    /* Phase 3: transmit waveform CSV burst right after weld completion event.
     */
    send_waveform_data();
}

/* ============================================================================
 *  Lead-Resistance Auto-Calibration  (UART command: "CAL_LEAD_START")
 * ============================================================================
 *
 *  Triggered remotely from the ESP32 / web dashboard.  The operator firmly
 *  SHORTS the two electrode tips together, then starts calibration.
 *
 *  Procedure:
 *    1. Safety gating (boot inhibit, system ready, not already welding,
 *       weld cooldown, over-temperature, minimum cap-bank voltage).
 *    2. Fire ONE short 100 %-duty test pulse (CAL_PULSE_MS) using the exact
 *       same TIM2 hardware FET-kill engine the weld path uses, so the MOSFETs
 *       can never latch on even if this routine misbehaves.
 *    3. While the FET is on (after a short settle window), sample weld current
 *       (shunt -> AMC1301) and cap-bank terminal voltage (AMC1311B) and keep
 *       running sums.
 *    4. With the tips shorted, essentially all of the cap-terminal voltage
 *       seen during the pulse is dropped across the downstream path
 *       (leads + MOSFET Rds_on + shunt), so the effective downstream/lead
 *       resistance is:
 *
 *           R_lead = V_cap_avg / I_avg
 *
 *       This is precisely the quantity the Joule-mode energy model consumes
 *       (v_at_tips = v_cap - I * lead_resistance_ohms), keeping calibration
 *       self-consistent with how the firmware already uses the value.
 *    5. Validate the result, persist to Flash (same path as SET_LEAD_R) and
 *       report "CAL_RESULT=<ohms>" on success or "CAL_ERROR=<reason>".
 *
 *  Reported lines (consumed by the Flask backend parser):
 *    CAL_STATUS=MEASURING        progress (non-terminal)
 *    CAL_RESULT=0.002850         success  (resistance in Ohms)
 *    CAL_ERROR=<REASON>          failure
 *  Extra "DBG,CAL,..." line is diagnostic only and ignored by the parser.
 */
#define CAL_MIN_VOLTAGE   6.0f      /* hard cap-bank voltage floor (V)        */
#define CAL_PULSE_MS      10U       /* total test-pulse duration (ms)         */
#define CAL_SETTLE_US     2000U     /* settle window before sampling (us)     */
#define CAL_MIN_CURRENT_A 50.0f     /* below this => tips not actually shorted*/
#define CAL_R_MIN_OHMS    0.0005f   /* 0.5 mOhm plausibility floor            */
#define CAL_R_MAX_OHMS    0.0100f   /* 10  mOhm plausibility ceiling          */

static void performLeadCalibration(void) {
    uint32_t now_ms = HAL_GetTick();

    /* ---- Safety gating (mirrors fireRecipe, minus ARM / contact) ----
     * The CAL_LEAD_START command is itself the explicit operator
     * authorization (web UI instructs the user to short the tips first),
     * so ARM and contact-detect are intentionally not required here. */
    if (now_ms - boot_ms < BOOT_INHIBIT_MS) {
        uartSend("CAL_ERROR=BOOT_INHIBIT");
        return;
    }

