farmertan81/Spot-Welder/STM32G474CE/src/main.c
    applyReadyTimeout();
    if (!system_ready) {
        uartSend("CAL_ERROR=NOT_READY");
        return;
    }
    if (welding_now) {
        uartSend("CAL_ERROR=BUSY");
        return;
    }
    if (temp_filtered_c > 65.0f) {
        uartSend("CAL_ERROR=OVERHEAT");
        return;
    }
    if ((now_ms - last_weld_ms) < WELD_COOLDOWN_MS) {
        uartSend("CAL_ERROR=COOLDOWN");
        return;
    }

    /* ---- Cap-bank voltage floor ----
     * Use ina_vpack (INA226 cell-sum) rather than readCapVoltage().
     * readCapVoltage() reads the AMC1311B (vcap) front-end, which only shows a
     * meaningful value while current is flowing and reads ~0 at idle, causing a
     * false CAL_ERROR=VOLTAGE_LOW even when the supercaps are fully charged.
     * ina_vpack always reflects the real pack voltage. */
    float v_before = ina_vpack;
    if (!isfinite(v_before) || v_before < CAL_MIN_VOLTAGE) {
        char eb[64];
        snprintf(eb, sizeof(eb), "CAL_ERROR=VOLTAGE_LOW,v=%.2f", v_before);
        uartSend(eb);
        return;
    }

    /* ---- Wait for an operator trigger using the existing weld trigger ----
     * Rather than re-implementing contact/pedal handling, reuse the same
     * contactDetected() detector the normal weld path uses.  This automatically
     * honours the user's configured trigger settings (threshold/debounce) and
     * keeps calibration behaviour identical to welding.
     *
     * Timing budget: this routine must finish inside the host's 12 s
     * calibration wait (CAL_RESULT_TIMEOUT_S).  The 8 s trigger timeout plus the
     * ~10 ms test pulse and settling leaves comfortable margin.  The wait loop
     * MUST refresh the IWDG (~800 ms timeout) or the MCU will reset. */
    uartSend("CAL_STATUS=WAITING_FOR_TRIGGER");

    uint32_t trigger_timeout_start = HAL_GetTick();
    const uint32_t trigger_timeout_ms = 8000U; /* 8 s max wait for trigger */

    /* Contact-hold state (only used in contact mode). Mirrors
     * pollContactTrigger(): require the tips to stay shorted for
     * (contact_hold_steps * 500 ms) before firing. */
    bool contact_hold_active_local = false;
    uint32_t contact_hold_start_local = 0;
    const uint32_t hold_ms_required = (uint32_t)contact_hold_steps * 500U;

    /* Decide whether contact is required, exactly like fireRecipe():
     * contact is needed unless we are in pedal mode with the contact check
     * explicitly disabled (contact_with_pedal == 0). */
    bool need_contact = true;
    if (trigger_mode == 1 && contact_with_pedal == 0) {
        need_contact = false;
    }

    bool triggered = false;

    while ((HAL_GetTick() - trigger_timeout_start) < trigger_timeout_ms) {
        HAL_IWDG_Refresh(&hiwdg); /* keep the watchdog alive while blocking */

        uint32_t now = HAL_GetTick();

        if (trigger_mode == 1) {
            /* ---- Pedal mode ---- active-low (external pull-up): RESET == pressed. */
            bool pedal_pressed =
                (HAL_GPIO_ReadPin(PEDAL_PORT, PEDAL_PIN) == GPIO_PIN_RESET);

            if (pedal_pressed) {
                if (need_contact) {
                    /* Pedal + contact required: only fire if tips are touching. */
                    if (contactDetected()) {
                        uartSend("CAL_STATUS=TRIGGER_DETECTED");
                        triggered = true;
                        break;
                    }
                    /* Pedal held but no contact yet: keep waiting. */
                } else {
                    /* Pedal only: fire immediately. */
                    uartSend("CAL_STATUS=TRIGGER_DETECTED");
                    triggered = true;
                    break;
                }
            }
        } else if (trigger_mode == 2) {
            /* ---- Contact mode ---- require a sustained hold like pollContactTrigger(). */
            bool contact_now = contactDetected();

            if (!contact_now) {
                /* Contact released before the hold completed: reset timer. */
                contact_hold_active_local = false;
                contact_hold_start_local = 0;
            } else if (!contact_hold_active_local) {
                /* First detection: start the hold timer. */
                contact_hold_active_local = true;
                contact_hold_start_local = now;
                uartSend("CAL_STATUS=CONTACT_DETECTED_HOLDING");
            } else if ((now - contact_hold_start_local) >= hold_ms_required) {
                /* Held long enough: fire. */
                uartSend("CAL_STATUS=TRIGGER_DETECTED");
                triggered = true;
                break;
            }
        }

        HAL_Delay(10); /* check every 10 ms */
    }

    if (!triggered) {
        uartSend("CAL_ERROR=TIMEOUT_NO_TRIGGER");
        return;
    }

    /* ---- Prevent a double pulse in contact mode ----
     * The tips are shorted right now (that short is what triggered the
     * calibration). performLeadCalibration() detects the trigger with its own
     * LOCAL hold timer and never touches the GLOBAL contact-trigger state that
     * pollContactTrigger() uses in the main loop. So once we return, the still
     * shorted tips look like a fresh weld trigger to pollContactTrigger(),
     * which then fires a real (second) full-energy weld -- the reported double
     * pulse.
     *
     * Latch the same fire-lock that pollContactTrigger() sets after it fires.
     * This forces the operator to release the tips (contact opens) before any
     * further weld can fire; pollContactTrigger() auto-clears the lock on that
     * release edge. Pedal mode is edge-triggered (pollPedal) so it is not
     * affected and needs no change. */
    if (trigger_mode == 2) {
        contact_fire_lock     = true;
        contact_hold_active   = true;
        contact_hold_start_ms = HAL_GetTick();
    }

    uartSend("CAL_STATUS=MEASURING");

    /* ---- Prepare exactly like a weld: charger off, fast ADC ---- */
    HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
    charger_enabled = false;
    HAL_Delay(20); /* let charger node settle */

