farmertan81/Spot-Welder/STM32G474CE/src/main.c
    if (strncmp(line, "CMD,SET,PULSE,", 14) == 0) {
        int val = atoi(line + 14);
        if (val > 0 && val <= MAX_WELD_MS) {
            weld_d1_ms = (uint16_t)val;
            snprintf(response, sizeof(response), "ACK,PULSE=%d", weld_d1_ms);
            uartSend(response);
        } else {
            uartSend("ERR,PULSE_RANGE");
        }
        return;
    }

    if (strncmp(line, "SET_PULSE,", 10) == 0) {
        int v_mode = 1, v_d1 = 0, v_gap1 = 0, v_d2 = 0, v_gap2 = 0, v_d3 = 0;
        int n = sscanf(line, "SET_PULSE,%d,%d,%d,%d,%d,%d", &v_mode, &v_d1,
                       &v_gap1, &v_d2, &v_gap2, &v_d3);
        if (n == 6) {
            weld_mode = (uint8_t)v_mode;
            weld_d1_ms = (uint16_t)v_d1;
            weld_gap1_ms = (uint16_t)v_gap1;
            weld_d2_ms = (uint16_t)v_d2;
            weld_gap2_ms = (uint16_t)v_gap2;
            weld_d3_ms = (uint16_t)v_d3;
            clampParams();

            persistent_from_runtime(&g_persistent_settings);
            if (!flash_settings_save(&g_persistent_settings)) {
                uartSend("DENY,SET_PULSE,FLASH_FAIL");
                return;
            }

            uartSend("ACK,SET_PULSE");
            sendStatusPacket();
        } else {
            uartSend("DENY,BAD_SET_PULSE");
        }
        return;
    }

    if (strncmp(line, "CMD,SET,POWER,", 14) == 0) {
        int val = atoi(line + 14);
        if (val >= 50 && val <= 100) {
            weld_power_pct = (uint8_t)val;
            snprintf(response, sizeof(response), "ACK,POWER=%d",
                     weld_power_pct);
            uartSend(response);
        } else {
            uartSend("ERR,POWER_RANGE");
        }
        return;
    }

    if (strncmp(line, "SET_POWER,", 10) == 0) {
        weld_power_pct = (uint8_t)atoi(line + 10);
        clampParams();
        persistent_from_runtime(&g_persistent_settings);
        if (!flash_settings_save(&g_persistent_settings)) {
            uartSend("DENY,SET_POWER,FLASH_SAVE_FAILED");
            return;
        }
        snprintf(response, sizeof(response), "ACK,SET_POWER,pct=%d",
                 weld_power_pct);
        uartSend(response);
        sendStatusPacket();
        return;
    }

    if (strncmp(line, "SET_MODE,", 9) == 0) {
        int new_mode_i = atoi(line + 9);
        if (new_mode_i >= 0 && new_mode_i <= 1) {
            control_mode = (uint8_t)new_mode_i;
            clampParams();
            persistent_from_runtime(&g_persistent_settings);
            if (!flash_settings_save(&g_persistent_settings)) {
                uartSend("DENY,SET_MODE,FLASH_SAVE_FAILED");
                return;
            }
            snprintf(response, sizeof(response), "ACK,SET_MODE,mode=%u",
                     (unsigned)control_mode);
            uartSend(response);
            sendStatusPacket();
        } else {
            uartSend("DENY,SET_MODE,RANGE");
        }
        return;
    }

    if (strncmp(line, "SET_JOULE_TARGET,", 17) == 0) {
        char* endptr = NULL;
        float new_target = strtof(line + 17, &endptr);
        if (endptr == (line + 17) || (endptr && *endptr != '\0') ||
            !isfinite(new_target)) {
            uartSend("DENY,SET_JOULE_TARGET,PARSE");
            return;
        }

        if (new_target >= 0.0f && new_target <= 300.0f) {
            float old_target = joule_target_j;
            snprintf(response, sizeof(response),
                     "DBG,SET_JOULE_TARGET,old=%.1f,new=%.1f", old_target,
                     new_target);
            uartSend(response);

            joule_target_j = new_target;
            clampParams();
            persistent_from_runtime(&g_persistent_settings);
            if (!flash_settings_save(&g_persistent_settings)) {
                uartSend("DENY,SET_JOULE_TARGET,FLASH_SAVE_FAILED");
                return;
            }
            snprintf(response, sizeof(response), "ACK,SET_JOULE_TARGET,j=%.1f",
                     joule_target_j);
            uartSend(response);
            sendStatusPacket();
        } else {
            uartSend("DENY,SET_JOULE_TARGET,RANGE");
        }
        return;
    }

    if (strncmp(line, "SET_JOULE_MAX,", 14) == 0) {
        int new_max_i = atoi(line + 14);
        if (new_max_i >= 5 && new_max_i <= 500) {
            joule_max_ms = (uint32_t)new_max_i;
            clampParams();
            persistent_from_runtime(&g_persistent_settings);
            if (!flash_settings_save(&g_persistent_settings)) {
                uartSend("DENY,SET_JOULE_MAX,FLASH_SAVE_FAILED");
                return;
            }
            snprintf(response, sizeof(response), "ACK,SET_JOULE_MAX,ms=%lu",
                     (unsigned long)joule_max_ms);
            uartSend(response);
            sendStatusPacket();
        } else {
            uartSend("DENY,SET_JOULE_MAX,RANGE");
        }
        return;
    }

    if (strncmp(line, "SET_PREHEAT,", 12) == 0) {
        int v_en = 0, v_ms = 0, v_pct = 0, v_gap = 0;
        int n = sscanf(line, "SET_PREHEAT,%d,%d,%d,%d", &v_en, &v_ms, &v_pct,
                       &v_gap);
        if (n >= 3) {
            preheat_enabled = (v_en == 1);
            preheat_ms = (uint16_t)v_ms;
            preheat_pct = (uint8_t)v_pct;
            if (n >= 4) preheat_gap_ms = (uint16_t)v_gap;
            clampParams();
            persistent_from_runtime(&g_persistent_settings);
            if (!flash_settings_save(&g_persistent_settings)) {
                uartSend("DENY,SET_PREHEAT,FLASH_SAVE_FAILED");
                return;
            }
            snprintf(response, sizeof(response),
                     "ACK,SET_PREHEAT,en=%d,ms=%u,pct=%u,gap=%u",
                     preheat_enabled ? 1 : 0, (unsigned)preheat_ms,
                     (unsigned)preheat_pct, (unsigned)preheat_gap_ms);
            uartSend(response);
            sendStatusPacket();
        } else {
            uartSend("DENY,BAD_SET_PREHEAT");
        }
        return;
    }

    if (strncmp(line, "SET_TRIGGER_MODE,", 17) == 0) {
        int v = atoi(line + 17);
        if (v < 1) v = 1;
        if (v > 2) v = 2;
        trigger_mode = (uint8_t)v;

        persistent_from_runtime(&g_persistent_settings);
        if (!flash_settings_save(&g_persistent_settings)) {
            uartSend("DENY,SET_TRIGGER_MODE,FLASH_SAVE_FAILED");
            return;
        }

        snprintf(response, sizeof(response), "ACK,SET_TRIGGER_MODE,mode=%d",
                 trigger_mode);
        uartSend(response);
        sendStatusPacket();
        return;
    }

    const char* cwp_prefix = "SET_CONTACT_WITH_PEDAL,";
    if (strncmp(line, cwp_prefix, strlen(cwp_prefix)) == 0) {
        int v = atoi(line + strlen(cwp_prefix));
        contact_with_pedal = (v == 0) ? 0 : 1;
        persistent_from_runtime(&g_persistent_settings);
        if (!flash_settings_save(&g_persistent_settings)) {
            uartSend("DENY,SET_CONTACT_WITH_PEDAL,FLASH_SAVE_FAILED");
            return;
        }
        snprintf(response, sizeof(response), "ACK,SET_CONTACT_WITH_PEDAL,%d",
                 contact_with_pedal);
        uartSend(response);
        sendStatusPacket();
        return;
    }

    if (strncmp(line, "CONTACT_THRESH=", 15) == 0) {
        float v = strtof(line + 15, NULL);
        if (v < 0.1f) v = 0.1f;
        if (v > 9.0f) v = 9.0f;
        g_contact_threshold_v = v;
        g_contact_state = false;
        g_contact_pending_high = false;
        g_contact_pending_since_ms = 0;
        snprintf(response, sizeof(response), "OK,CONTACT_THRESH=%.2f",
                 g_contact_threshold_v);
        uartSend(response);
        return;
    }

