farmertan81/Spot-Welder/STM32G474CE/src/main.c
    if (strncmp(line, "SET_CONTACT_THRESH,", 19) == 0) {
        float v = strtof(line + 19, NULL);
        if (v < 0.1f) v = 0.1f;
        if (v > 9.0f) v = 9.0f;
        g_contact_threshold_v = v;
        g_contact_state = false;
        g_contact_pending_high = false;
        g_contact_pending_since_ms = 0;
        snprintf(response, sizeof(response), "ACK,SET_CONTACT_THRESH,%.2f",
                 g_contact_threshold_v);
        uartSend(response);
        return;
    }

    if (strncmp(line, "SET_CONTACT_HOLD,", 17) == 0) {
        int v = atoi(line + 17);
        if (v < 1) v = 1;
        if (v > 10) v = 10;
        contact_hold_steps = (uint8_t)v;

        persistent_from_runtime(&g_persistent_settings);
        if (!flash_settings_save(&g_persistent_settings)) {
            uartSend("DENY,SET_CONTACT_HOLD,FLASH_SAVE_FAILED");
            return;
        }

        snprintf(response, sizeof(response), "ACK,SET_CONTACT_HOLD,steps=%d",
                 contact_hold_steps);
        uartSend(response);
        sendStatusPacket();
        return;
    }

    /* UI save flakiness root cause: some clients send lead_r_mohm while
     * firmware only accepted LEAD_R in ohms. Accept both ohm and mΩ command
     * variants. */
    if (strncmp(line, "LEAD_R,", 7) == 0 ||
        strncmp(line, "SET_LEAD_R,", 11) == 0 ||
        strncmp(line, "LEAD_R_MOHM,", 12) == 0 ||
        strncmp(line, "SET_LEAD_R_MOHM,", 16) == 0 ||
        strncmp(line, "lead_r_mohm,", 12) == 0 ||
        strncmp(line, "set_lead_r_mohm,", 16) == 0) {
        bool value_is_mohm = false;
        const char* value_str = NULL;

        if (strncmp(line, "LEAD_R,", 7) == 0) {
            value_str = line + 7;
        } else if (strncmp(line, "SET_LEAD_R,", 11) == 0) {
            value_str = line + 11;
        } else if (strncmp(line, "LEAD_R_MOHM,", 12) == 0) {
            value_is_mohm = true;
            value_str = line + 12;
        } else if (strncmp(line, "SET_LEAD_R_MOHM,", 16) == 0) {
            value_is_mohm = true;
            value_str = line + 16;
        } else if (strncmp(line, "lead_r_mohm,", 12) == 0) {
            value_is_mohm = true;
            value_str = line + 12;
        } else {
            value_is_mohm = true;
            value_str = line + 16;
        }

        char* endptr = NULL;
        float v = strtof(value_str, &endptr);

        if (endptr == value_str || (endptr && *endptr != '\0') ||
            !isfinite(v)) {
            uartSend("ERR,LEAD_R_PARSE");
            return;
        }

        if (value_is_mohm) {
            v *= 0.001f;
        }

        if (v < LEAD_RESISTANCE_MIN_OHMS || v > LEAD_RESISTANCE_MAX_OHMS) {
            snprintf(response, sizeof(response),
                     "ERR,LEAD_R_RANGE,min=%.6f,max=%.6f",
                     LEAD_RESISTANCE_MIN_OHMS, LEAD_RESISTANCE_MAX_OHMS);
            uartSend(response);
            return;
        }

        lead_resistance_ohms = v;
        persistent_from_runtime(&g_persistent_settings);
        if (!flash_settings_save(&g_persistent_settings)) {
            uartSend("DENY,LEAD_R,FLASH_SAVE_FAILED");
            return;
        }

        char ack[80];
        snprintf(ack, sizeof(ack), "ACK,LEAD_R,ohm=%.6f,mohm=%.3f",
                 lead_resistance_ohms, lead_resistance_ohms * 1000.0f);
        uartSend(ack);
        sendStatusPacket();  // Immediate broadcast so UI updates right away
        return;
    }

    if (strcmp(line, "GET_LEAD_R") == 0 || strcmp(line, "LEAD_R?") == 0 ||
        strcmp(line, "GET_LEAD_R_MOHM") == 0 ||
        strcmp(line, "lead_r_mohm?") == 0) {
        snprintf(response, sizeof(response), "LEAD_R,ohm=%.6f,mohm=%.3f",
                 lead_resistance_ohms, lead_resistance_ohms * 1000.0f);
        uartSend(response);
        return;
    }

    if (strcmp(line, "CAL_LEAD_START") == 0 ||
        strcmp(line, "CMD,CAL_LEAD_START") == 0) {
        performLeadCalibration();
        return;
    }

    if (strcmp(line, "CMD,FIRE") == 0) {
        fireRecipe();
        return;
    }

    if (strcmp(line, "CMD,ENABLE") == 0) {
        armed = true;
        uartSend("ACK,ENABLED");
        return;
    }

    if (strcmp(line, "CMD,DISABLE") == 0) {
        armed = false;
        uartSend("ACK,DISABLED");
        return;
    }

    if (strcmp(line, "STATUS") == 0 || strcmp(line, "CMD,STATUS") == 0) {
        /* Send both STATUS and STATUS2 packets on demand */
        sendStatusPacket();
        return;
    }
    if (strcmp(line, "DBG_SHUNT") == 0) {
        adcPrepareFastCurrentChannels();

        uint32_t p = 0U;
        uint32_t n = 0U;
        if (!adcReadFastCurrentPair(&p, &n)) {
            uartSend("ERR,DBG_SHUNT_ADC_FAIL");
            return;
        }

        char buf[128];
        snprintf(buf, sizeof(buf), "DBG,SHUNT,p=%lu,n=%lu,diff=%ld,vdda=%.3f",
                 (unsigned long)p, (unsigned long)n,
                 (long)((int32_t)p - (int32_t)n), measured_vdda);

        uartSend(buf);
        return;
    }

    snprintf(response, sizeof(response), "ERR,UNKNOWN_CMD,rx=%s", line);
    uartSend(response);
}

static void pollPedal(void) {
    GPIO_PinState raw = HAL_GPIO_ReadPin(PEDAL_PORT, PEDAL_PIN);
    uint32_t now = HAL_GetTick();

    if (raw != pedal_last_raw) {
        pedal_last_change_ms = now;
        pedal_last_raw = raw;
    }

    if ((now - pedal_last_change_ms) >= PEDAL_DEBOUNCE_MS) {
        if (raw != pedal_stable) {
            GPIO_PinState prev = pedal_stable;
            pedal_stable = raw;

            if (prev == GPIO_PIN_SET && pedal_stable == GPIO_PIN_RESET) {
                uartSend("EVENT,PEDAL_PRESS");
                if (trigger_mode == 1) {
                    fireRecipe();
                }
            }
        }
    }
}

static void pollContactTrigger(void) {
    if (trigger_mode != 2) {
        contact_hold_active = false;
        contact_hold_start_ms = 0;
        contact_fire_lock = false;
        return;
    }

    bool contact_now = contactDetected();
    uint32_t now = HAL_GetTick();
    uint32_t hold_ms_required = (uint32_t)contact_hold_steps * 500U;

    if (!contact_now) {
        contact_hold_active = false;
        contact_hold_start_ms = 0;
        /* Do NOT release the fire-lock while the charger lockout is active.
         * Right after a weld OR a calibration test pulse the cap is briefly
         * depleted, which makes the voltage-based contactDetected() read false
         * even though the operator is still holding the tips down. Clearing the
         * lock here would let those still-shorted tips re-trigger a weld the
         * instant the cap recharges -- the reported double pulse. The 500 ms
         * charger-lockout window covers this depletion transient; once it
         * expires, a genuine release (tips lifted) reads false with the cap
         * recharged and clears the lock normally. */
        if (!charger_lockout) {
            contact_fire_lock = false;
        }
        return;
    }

    if (contact_fire_lock) {
        return;
    }

    if (!contact_hold_active) {
        contact_hold_active = true;
        contact_hold_start_ms = now;
        return;
    }

    if ((now - contact_hold_start_ms) >= hold_ms_required) {
        uartSend("EVENT,CONTACT_TRIGGER");
        fireRecipe();
        contact_fire_lock = true;
    }
}

/* ============================================================
 * Software bootloader-jump support (remote firmware update)
 * ============================================================ */

/* Unlock the backup domain so TAMP->BKPxR registers are readable/writable.
 * Needed both to set the warm-reset request flag and to read it back early in
 * main(). Safe to call multiple times. */
static void bootloaderEnableBackupAccess(void) {
    __HAL_RCC_PWR_CLK_ENABLE();      /* PWR peripheral clock              */
    __HAL_RCC_RTCAPB_CLK_ENABLE();   /* RTC/TAMP APB clock (backup regs)  */
    HAL_PWR_EnableBkUpAccess();      /* clear PWR_CR1_DBP write-protect   */
}

/* Perform the actual ARM Cortex-M4 jump into the STM32G4 factory ROM
 * bootloader located in system memory at SYSTEM_BOOTLOADER_ADDR. This does NOT
 * return. It must only be called very early in main(), before the IWDG is
 * re-armed, so the bootloader runs with no active watchdog. */
static void jumpToBootloader(void) {
    /* First word = initial stack pointer, second word = reset/entry vector. */
    uint32_t bootStack = *(volatile uint32_t*)(SYSTEM_BOOTLOADER_ADDR);
    uint32_t bootEntry = *(volatile uint32_t*)(SYSTEM_BOOTLOADER_ADDR + 4U);
    void (*bootJump)(void) = (void (*)(void))bootEntry;

    /* --------------------------------------------------------------------
     * IWDG window extension (CRITICAL for the direct, no-reset jump).
     * We now jump straight from the running application instead of via
     * NVIC_SystemReset(). That means the software-mode IWDG that main()
     * started (~800 ms timeout) is STILL RUNNING, and the ROM bootloader
     * never refreshes it - so without this the watchdog would reset the
     * MCU out of the bootloader (back into the app) within ~800 ms.
     * The IWDG cannot be stopped once started, but its reload value can be
     * reconfigured on the fly. Push it to the maximum (~32.7 s @ /256, LSI
     * 32 kHz) to give the host the longest possible flashing window.
     * Harmless if the IWDG was never started (early-boot path). -------- */
    IWDG->KR  = 0x5555U;            /* unlock PR/RLR write access            */
    IWDG->PR  = IWDG_PRESCALER_256; /* slowest prescaler                     */
    IWDG->RLR = 0x0FFFU;            /* max reload -> longest timeout         */
    IWDG->KR  = 0xAAAAU;            /* refresh counter with the new reload   */

    /* --------------------------------------------------------------------
     * Deinitialize USART1 BEFORE jumping so the ROM bootloader inherits a
     * clean UART peripheral. The running application has USART1 configured
     * for 1 Mbaud 8N1 with RX interrupts; if we leave that in place the ROM
     * bootloader's own USART1 init can collide with the stale config and the
     * 0x7F auto-baud / RX never works. HAL_UART_DeInit() resets the registers
     * and runs MspDeInit (GPIO + NVIC), then we kill the peripheral clock so
     * the bootloader brings USART1 up from a true power-on state. Done while
     * clocks/ticks are still alive (before __disable_irq), as the HAL calls
     * expect a running SysTick. ------------------------------------------ */
    HAL_UART_DeInit(&huart1);
    __HAL_RCC_USART1_CLK_DISABLE();

    /* Mask all interrupts while we tear the system down. */
    __disable_irq();

    /* Stop SysTick so it cannot fire after we move the stack/vector table. */
    SysTick->CTRL = 0;
    SysTick->LOAD = 0;
    SysTick->VAL  = 0;

    /* Return clocks and every initialised peripheral to their reset state so
     * the ROM bootloader starts from a clean, well-defined configuration. */
    HAL_RCC_DeInit();
    HAL_DeInit();

    /* Disable and clear all NVIC interrupts that the application enabled. */
    for (uint32_t i = 0; i < (sizeof(NVIC->ICER) / sizeof(NVIC->ICER[0])); i++) {
        NVIC->ICER[i] = 0xFFFFFFFFUL;
        NVIC->ICPR[i] = 0xFFFFFFFFUL;
    }

