farmertan81/Spot-Welder/STM32G474CE/src/main.c
    /* Remap system memory (the ROM bootloader) to 0x00000000 so the chip is
     * in exactly the state it would be after a reset with BOOT0=1. This is
     * the missing half of the jump - setting SCB->VTOR alone is not enough;
     * the ROM bootloader expects to be aliased at address 0. The MEMRMP write
     * lives in SYSCFG, whose clock HAL_RCC_DeInit() just turned off, so it
     * must be re-enabled or the remap write is silently ignored. */
    __HAL_RCC_SYSCFG_CLK_ENABLE();
    __HAL_SYSCFG_REMAPMEMORY_SYSTEMFLASH();

    /* Point the vector table at the system-memory bootloader. */
    SCB->VTOR = SYSTEM_BOOTLOADER_ADDR;

    /* Load the bootloader's stack pointer and ensure it takes effect. */
    __set_MSP(bootStack);
    __DSB();
    __ISB();

    /* Re-enable interrupts and hand control to the bootloader. */
    __enable_irq();
    bootJump();

    /* Should never get here. */
    while (1) {
    }
}

/* Request entry into the ROM bootloader on the next boot. Stores the magic
 * sentinel in a backup register (survives the reset) and issues a system reset.
 * The reset also stops the software-mode IWDG; the early-boot check in main()
 * then detects the flag and calls jumpToBootloader(). This does NOT return. */
static void requestBootloaderReset(void) {
    char dbg[80];

    /* Prove we actually entered this function. If this line never appears the
     * call site itself is not being reached. */
    uartSend("DBG,Inside requestBootloaderReset() - START");
    HAL_Delay(50);

    uartSend("DBG,Setting TAMP register...");
    HAL_Delay(10);

    /* Unlock the backup domain (PWR + RTC/TAMP APB clock + DBP) so the backup
     * register is actually writable. Without this the write is silently
     * ignored and the magic never survives the reset. */
    bootloaderEnableBackupAccess();

    /* Write the magic sentinel and force the store to complete. */
    BOOTLOADER_FLAG_REG = BOOTLOADER_REQUEST_MAGIC;
    __DSB();

    /* Read the register straight back to prove the write actually stuck. If
     * this does NOT show 0xB00710AD then the backup domain is still locked or
     * the wrong register is being used. */
    snprintf(dbg, sizeof(dbg), "DBG,TAMP register set to 0x%08lX",
             (unsigned long)BOOTLOADER_FLAG_REG);
    uartSend(dbg);
    HAL_Delay(10);

    snprintf(dbg, sizeof(dbg), "DBG,Expected magic    = 0x%08lX",
             (unsigned long)BOOTLOADER_REQUEST_MAGIC);
    uartSend(dbg);
    HAL_Delay(10);

    uartSend("DBG,Calling NVIC_SystemReset()...");
    HAL_Delay(50);  /* let the debug lines flush out of the UART before reset */

    NVIC_SystemReset();

    /* If we are still alive here the reset did NOT take effect. */
    uartSend("DBG,ERROR: NVIC_SystemReset() returned - reset FAILED!");
    while (1) {
    }
}

/* Boot-time snapshot of the TAMP backup register, captured before it is
 * cleared. Emitted over UART once the UART is initialised so the host can see
 * exactly what value survived the reset on a normal (no-magic) boot. */
static uint32_t g_boot_tamp_value = 0;

int main(void) {
    /* Disable the UCPD "dead battery" pull-down behavior at the very start.
     * After reset the STM32G4 enables ~5.1k Rd pull-downs on the UCPD1_CC1 and
     * UCPD1_CC2 pins (PB6 and PB4 on this package - see RM0440 Table, PWR_CR3
     * bit 14). We do not use USB Type-C / Power Delivery, and PB4/PB6 are GPIO,
     * so clear those pull-downs once the application runs. NOTE: this does NOT
     * affect USART1_RX (PA10) and does NOT change ROM-bootloader behavior - the
     * bootloader runs from a fresh reset where this bit is re-enabled anyway. */
    RCC->APB1ENR1 |= RCC_APB1ENR1_PWREN;   /* enable PWR peripheral clock   */
    PWR->CR3 |= PWR_CR3_UCPD_DBDIS;        /* remove UCPD CC dead-battery Rd */

    HAL_Init();

    /* Software bootloader entry: if the "BOOTLOADER" UART command requested an
     * update, requestBootloaderReset() stored a magic value in a backup register
     * and reset the MCU (which also stopped the IWDG). Detect that here - BEFORE
     * the clocks/peripherals are configured and BEFORE MX_IWDG_Init() re-arms the
     * watchdog - clear the flag, and jump straight into the ROM bootloader. */
    bootloaderEnableBackupAccess();
    g_boot_tamp_value = BOOTLOADER_FLAG_REG;   /* snapshot for later logging */
    if (g_boot_tamp_value == BOOTLOADER_REQUEST_MAGIC) {
        BOOTLOADER_FLAG_REG = 0;   /* one-shot: clear so we boot normally next time */
        __DSB();

        /* Bring up just enough (clock + GPIO + UART) to emit the boot debug
         * lines BEFORE jumping. jumpToBootloader() fully de-inits the clocks
         * and peripherals afterwards, so the ROM bootloader still starts from a
         * clean state. This happens before MX_IWDG_Init(), so the watchdog is
         * not yet armed and these few extra milliseconds are safe. */
        SystemClock_Config();
        SystemCoreClockUpdate();
        HAL_InitTick(TICK_INT_PRIORITY);
        MX_GPIO_Init();
        MX_USART1_UART_Init();

        char dbg[64];
        snprintf(dbg, sizeof(dbg), "DBG,Boot: TAMP register = 0x%08lX",
                 (unsigned long)g_boot_tamp_value);
        uartSend(dbg);
        uartSend("DBG,Boot: Magic match - jumping to bootloader!");
        HAL_Delay(30);             /* flush the UART before tearing down clocks */

        jumpToBootloader();        /* does not return */
    }

    SystemClock_Config();
    SystemCoreClockUpdate();
    HAL_InitTick(TICK_INT_PRIORITY);

    /* Enable DWT cycle counter for microsecond timestamps used by waveform
     * capture. */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    MX_GPIO_Init();

    /* 100ms delay for INA226 power rail stabilization */
    HAL_Delay(100);

    for (int i = 0; i < 3; i++) {
        HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
        HAL_Delay(80);
    }

    /* I2C bus recovery before initialization – unstick any hung devices */
    i2c_bus_recovery();

    MX_I2C1_Init(); /* I2C1 for INA226 sensors – graceful, no hang */
    MX_USART1_UART_Init();

    /* Report the boot-time TAMP value now that the UART is up. On a normal
     * power-on this should be 0x00000000 (no bootloader request). If it shows
     * the magic 0xB00710AD here it means the early-boot jump was skipped. */
    {
        char dbg[64];
        snprintf(dbg, sizeof(dbg), "DBG,Boot: TAMP register = 0x%08lX",
                 (unsigned long)g_boot_tamp_value);
        uartSend(dbg);
        uartSend("DBG,Boot: No magic - normal boot");
    }

    persistent_defaults(&g_persistent_settings);
    flash_settings_init();
    bool load_ok = flash_settings_load(&g_persistent_settings);
    if (load_ok) {
        apply_loaded_settings(&g_persistent_settings);
    } else {
        persistent_defaults(&g_persistent_settings);
        apply_loaded_settings(&g_persistent_settings);
        uartSend("WARN,FLASH_LOAD_FAILED,USING_DEFAULTS");
    }

    // Boot override: always start disarmed + pedal trigger, regardless of what
    // was in flash. Other persisted settings (contact_hold, lead_r, etc.) are
    // respected, but for safety the welder must boot in the safe state.
    armed = false;
    trigger_mode = 1;  // 1 = pedal, 2 = probe contact

    {
        char buf[128];
        snprintf(buf, sizeof(buf),
                 "DBG,BOOT,control_mode=%d,joule_target_j=%.1f", control_mode,
                 joule_target_j);
        uartSend(buf);
    }

    MX_ADC1_Init();
    OPAMP1->CSR &= ~OPAMP_CSR_OPAMPxEN;
    MX_ADC2_Init(); /* ADC2 for PA4 (AMC1311B OUTN = ADC2_IN17) */
    MX_TIM1_Init();
    init_tim2_1mhz();

